In [1]:
import pandas as pd

In [13]:
friend_list = [
    ['name',['john', 'jenny', 'Nate']],
    ['age',[20, 30, 30]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [14]:
df

    name  age        job
0   john   20    student
1  jenny   30  developer
2   Nate   30    teacher

In [16]:
df[1:3]

    name  age        job
1  jenny   30  developer
2   Nate   30    teacher

In [17]:
df

    name  age        job
0   john   20    student
1  jenny   30  developer
2   Nate   30    teacher

In [18]:
df.loc[[0,2]]

   name  age      job
0  john   20  student
2  Nate   30  teacher

In [19]:
df = df.loc[[0,2]]

In [20]:
df

   name  age      job
0  john   20  student
2  Nate   30  teacher

In [21]:
friend_list = [
    ['name',['john', 'jenny', 'Nate']],
    ['age',[20, 30, 30]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [22]:
df

    name  age        job
0   john   20    student
1  jenny   30  developer
2   Nate   30    teacher

In [25]:
# by column condition

In [26]:
df[df.age > 25]

    name  age        job
1  jenny   30  developer
2   Nate   30    teacher

In [27]:
df.query('age>25')

    name  age        job
1  jenny   30  developer
2   Nate   30    teacher

In [28]:
df

    name  age        job
0   john   20    student
1  jenny   30  developer
2   Nate   30    teacher

In [29]:
df[(df.age>25 & (df.name == 'Nate'))]

    name  age        job
0   john   20    student
1  jenny   30  developer
2   Nate   30    teacher

In [1]:
#Filter Column

In [2]:
# by index

In [8]:
import pandas as pd
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [11]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [12]:
##by column name

In [ ]:
df =